app/Http/Middleware/IdentifyTenantFromUrl.php

select * from `companies` where `slug` = 'company-1' limit 1
---
    public function handle(Request $request, Closure $next)
    {
        // Haal het eerste URL-segment op
        $slug = $request->segment(1);

        // Zoek de juiste company op basis van slug
        $company = Company::where('slug', $slug)->first();