app/Livewire/Partials/Navbar.php

    public function mount(?string $slug = null)
    {
        // Haal de slug op van de actieve tenant (company)
        $this->slug = $slug ?? \App\Services\TenantService::slug();

        // Telt alle items in de cart op inclusief quantity
        $this->total_count = array_sum(array_column(CartManagement::getCartItemsFromSession(), 'quantity'));

        // Haal de free_shipping_threshold uit de database
        $setting = Setting::first();
---
select * from `settings` limit 1