app/Helpers/CartManagement.php

select `id`, `name`, `price`, `images`, `slug`, `shipping_cost` from `products` where `products`.`id` = 2 limit 1
---
    static public function addItemToCart($product_id) {
        $company = app()->has('current_company') ? app()->make('current_company') : null;
        $cart_items = self::getCartItemsFromSession();

        // Verwijder items van andere tenants als we een nieuwe toevoegen
        if ($company) {
            $cart_items = array_filter($cart_items, function($item) use ($company) {
                $product = Product::find($item['product_id']);
                return $product && $product->company_id == $company->id;
            });
        }

        $existing_item = null;
        foreach($cart_items as $key => $item) {
            if($item['product_id'] == $product_id) {
                $existing_item = $key;
                break;
            }
        }

        $product = Product::when($company, function($query) use ($company) {
            $query->where('company_id', $company->id);
        })
            ->find($product_id, ['id', 'name', 'price', 'images', 'company_id']);