app/Filament/Resources/OrderResource/Widgets/OrderStats.php

    protected function getStats(): array
    {
        $tenantId = Filament::getTenant()->id;

        return [
            Stat::make('New Orders',
                Order::query()
                    ->where('company_id', $tenantId) // stats enkel van de company
                    ->where('status', 'new')
                    ->count()
            ),
            Stat::make('Order Processing',
                Order::query()
                    ->where('company_id', $tenantId)
                    ->where('status', 'processing')
                    ->count()
            ),
            Stat::make('Order Shipped',
                Order::query()
                    ->where('company_id', $tenantId)
                    ->where('status', 'shipped')
                    ->count()
            ),
            Stat::make('Average Price',
                Number::currency(
                    Order::query()
                        ->where('company_id', $tenantId)
                        ->avg('grand_total') ?? 0,
                    'EUR'
                )
            ),
---
select count(*) as aggregate from `orders` where `status` = 'shipped' and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `company_id` = 2 and `status` = 'new' and `orders`.`company_id` in (2) and `orders`.`company_id` in (2) and `company_id` = 2
select count(*) as aggregate from `orders` where `company_id` = 2 and `status` = 'processing' and `orders`.`company_id` in (2) and `orders`.`company_id` in (2) and `company_id` = 2
select count(*) as aggregate from `orders` where `company_id` = 2 and `status` = 'shipped' and `orders`.`company_id` in (2) and `orders`.`company_id` in (2) and `company_id` = 2
select avg(`grand_total`) as aggregate from `orders` where `company_id` = 2 and `orders`.`company_id` in (2) and `orders`.`company_id` in (2) and `company_id` = 2