app/Livewire/CartPage.php

    public function removeItem($product_id) {
        $product = Product::where('id', $product_id)
            ->when($this->current_company, function($query) {
                $query->where('company_id', $this->current_company->id);
            })
            ->first();
---
select * from `products` where `products`.`id` = 1 and `products`.`deleted_at` is null limit 1