app/Livewire/CheckoutPage.php

select * from `settings` limit 1
select * from `addresses` where `addresses`.`user_id` = 6 and `addresses`.`user_id` is not null and `addresses`.`deleted_at` is null limit 1
---
    public function mount(){
        $cart_items = CartManagement::getCartItemsFromSession();
        if(count($cart_items) == 0){
            return redirect('/products');
        }

        $this->sameAsBilling = true;

        $setting = Setting::first();
        $this->free_shipping_threshold = $setting->free_shipping_threshold ?? 0;

        $this->sub_total = CartManagement::calculateGrandTotal($cart_items);
        $this->calculateShippingAmount($cart_items);

        // AUTO-FILL adresgegevens indien beschikbaar
        $user = auth()->user();
        if ($user && $user->address) {
            $this->billing_first_name = $user->address->first_name;