app/Livewire/MyOrdersPage.php

    public function render()
    {

        $my_orders = Order::where('user_id', auth()->id())
            ->when($this->current_company, function ($query) {
                $query->where('company_id', $this->current_company->id);
            })
            ->latest()
            ->paginate(6);
---
select * from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null