app/Livewire/ProductDetailPage.php

select * from `companies` where `slug` = 'company-1' limit 1
---
    public function render()
    {
        $product = Product::where('slug', $this->slug)
            ->when($this->current_company, function($query) {
                $query->where('company_id', $this->current_company->id);
            })
            ->first();