app/Livewire/ProductDetailPage.php

select * from `products` where `slug` = 'nordic-lounge-chair' and `products`.`deleted_at` is null limit 1
select `colors`.*, `color_product`.`product_id` as `pivot_product_id`, `color_product`.`color_id` as `pivot_color_id` from `colors` inner join `color_product` on `colors`.`id` = `color_product`.`color_id` where `color_product`.`product_id` in (1) and `colors`.`deleted_at` is null
---
    public function mount($slug)
    {
        $this->slug = $slug;

        // tenant filter
        $this->product = Product::with('colors')
            ->where('slug', $slug)
            ->where('company_id', currentCompany()?->id) //  multi-tenancy filter
            ->first();

select * from `products` where `is_active` = 1 and `is_featured` = 1 limit 8
select * from `products` where `slug` = 'nordic-lounge-chair' limit 1
---
    public function render()
    {
        // haal alleen de actieve, featured producten op (max. 8)
        $featuredProducts = Product::query()
            ->where('company_id', currentCompany()?->id) // multi-tenant
            ->where('is_active', 1)
            ->where('is_featured', 1)
            ->take(8)
            ->get();

        return view('livewire.product-detail-page', [
            'product' => Product::where('slug', $this->slug)->firstOrFail(),
            'featuredProducts' => $featuredProducts
        ]);