app/Livewire/SuccessPage.php

select * from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null order by `created_at` desc limit 1
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null
---
    public function render()
    {
        $order = null;

        // Als er een Stripe session_id in de URL is, maak dan het order aan
        if ($this->session_id) {
            $order = $this->handleStripeSuccess();
        } else {
            // Voor COD orders, haal de laatste order op
            $order = Order::with('user')
                ->where('user_id', auth()->id())
                ->latest()
                ->firstOrFail();

insert into `order_items` (`product_id`, `color_id`, `quantity`, `unit_amount`, `total_amount`, `order_id`, `updated_at`, `created_at`) values (2, 6, 1, '349.00', 349, 12, '2025-06-16 10:20:04', '2025-06-16 10:20:04')
select * from `product_color_stocks` where `product_id` = 2 and `color_id` = 6 limit 1
---
        $order->save();

        // Sla order items op
        $order->items()->createMany($cart_items);

        // Verlaag stock
        foreach ($cart_items as $item) {
            $stockEntry = ProductColorStock::where('product_id', $item['product_id'])
                ->where('color_id', $item['color_id'])
                ->first();

select * from `orders` where `orders`.`id` = 12 and `orders`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null
---
        Mail::to($order->user->email)->send(new InvoicePaidMail($order));

        // Herlaad order met relaties voor de view
        return Order::with('user')->find($order->id);