app/Livewire/SuccessPage.php

select * from `addresses` where `addresses`.`order_id` in (10) and `addresses`.`deleted_at` is null
---
    public function render()
    {
        // Haal de huidige company op (als die er is)
        $company = app()->has('current_company') ? app()->make('current_company') : null;

        // haal de laatste bestelling op van de ingelogde user
        // TENANT toevoegen
        $latest_order = Order::with('address')
            ->where('user_id', auth()->id())
            ->when(app()->has('current_company'), function ($query) {
                $query->where('company_id', app()->make('current_company')->id);
            })
            ->latest()
            ->firstOrFail();